app/controllers/api/v1/events_controller.rb

    def index
        @events = Event.where(user_id: params[:user_id])
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = $1 LIMIT $2  [["user_id", 7], ["LIMIT", 1]]

    def show
        @event = Event.where(user_id: params[:user_id], id: params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = $1 AND "events"."id" = $2  [["user_id", 7], ["id", 2]]

    def create
        # p params
        @event = Event.create(event: params["event"], event_type: params["event_type"], user_id: params["user_id"])
---
INSERT INTO "events" ("user_id", "event", "event_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 9], ["event", "jav"], ["event_type", "field"], ["created_at", "2020-09-15 13:30:28.959873"], ["updated_at", "2020-09-15 13:30:28.959873"]]

    def update
        if @event
            @event.update(event: params["event"], event_type: params["event_type"])
---
UPDATE "events" SET "event" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["event", "javelin"], ["updated_at", "2020-09-15 16:09:44.842154"], ["id", 5]]

    def destroy
        if @event
            @event.destroy
---
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 5]]

    def find_event
        @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]