app/controllers/api/v1/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "Megs"], ["password", "megspass"], ["created_at", "2020-09-15 00:57:36.897486"], ["updated_at", "2020-09-15 00:57:36.897486"]]

    def update
        @user = User.find(params[:id])
        if @user
            @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "meg"], ["password", "megpass"], ["updated_at", "2020-09-15 16:27:35.415328"], ["id", 9]]

    def destroy
        @user = User.find(params[:id])
        if @user
            @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 9]]